---
kind: type
id: T:Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeServiceResult
source: html/d637e2e7-215c-ac8e-7c9a-9311a07d68ba.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationNetworkChangeServiceResult

Possible results from invoking the FabricationNetworkChangeService.

## Syntax (C#)
```csharp
public enum FabricationNetworkChangeServiceResult
```